
[
    {
        "jobtitle": "Software Engineer",
        "company": "Workday",
        "time": "Sep 2018 - Jun 2022",
        "bullets": [
            "Served teams as a Scrum Master for Workday's content management site built with Docker, PHP and MySQL.",
            "Added new features including content audit tools, content archival and community user group operations.",
            "Integrated the site login system with Okta using APIs, providing improved customer experience and security",
            "Delivered new user interfaces built with React for feedback and search.",
            "Wrote and optimized unit tests that reduced bugs and prevented downtime throughout the site."
        ]
    },
    {
        "jobtitle": "Software Engineer",
        "company": "Tesla (formerly SolarCity)",
        "time": "Sep 2015 - Sep 2018",
        "bullets": [
            "Built a utility bill calculator capable of predicting long-term customer electricity costs anywhere in the country, resulting in increased customer confidence and decreased risk of legal liability.",
            "Redesigned a monolithic pricing engine to improve solar pricing clarity, adapt to changing product requirements and improve automated test coverage while adhering to rigorous weekly deadlines.",
            "Constructed SQL queries that retrieved customer and reference data that led to efficient object-relational mappings.",
            "Implemented automated tests, Splunk logging, data auditing, input validation and removed outdated dependencies",
            "Diagnosed and resolved issues during live production releases that preserved thousands of dollars of revenue."
        ]
    },
    {
        "jobtitle": "Software Engineer",
        "company": "Island Insurance",
        "time": "Jul 2014 - Oct 2015",
        "bullets": [
            "Developed a web portal using C# and stored procedures to retrieve customer data from over 20 insurance agencies.",
            "Programmed responsive interfaces that display data structures derived from databases, algorithms, and callbacks."
        ]
    },
    {
        "jobtitle": "Web Application Developer",
        "company": "Ideas Health",
        "time": "Sep 2014 - Jul 2014",
        "bullets": [ 
            "Designed the front-end of an enterprise web application using the .NET MVC framework and JavaScript.",
            "Constructed interfaces using controls such as grids, graphs, drop-downs, and calendars with agile workflow."
        ]
    },
    {
        "jobtitle": "Instructional Technician",
        "company": "Livermore School District",
        "time": "Sep 2011 - Dec 2012",
        "bullets": [ 
            "Established a file sharing server for students across campus, resulting in renewed enthusiasm among teachers and staff."
        ]
    },
    {
        "jobtitle": "Technical Writer",
        "company": "FileMaker",
        "time": "Jan 2010 - Jul 2010",
        "bullets": [ 
            "Verified and documented over 40 software errors and rewrote a popular tutorial, increasing product quality."
        ]
    },
    {
        "jobtitle": "Technical Trainer / Writer",
        "company": "Force10 Networks",
        "time": "Oct 2008 - Jun 2009",
        "bullets": [ 
            "Taught a rigorous networking certification course to over 20 professionals and rewrote three certification exams."
        ]
    }
]