[
  {
    "jobtitle": "Software Engineer",
    "companyUrl": "https://www.pixelberrystudios.com",
    "company": "Pixelberry Studios",
    "time": "Sep 2022 - Present",
    "bullets": [
      "Developed a flagship web game platform built with React, TypeScript and AWS that drove company revenue and customer experience.",
      "Deployed Express and GraphQL APIs and rewrote CI/CD scripts that improved modularity and reduced average site load times by seconds.",
      "Innovated new features such as user revenue visualization, using libraries like Redux and Recharts that resulted in greater customer retention.",
      "Spearheaded the integration of Datadog web analytics with cloud-based systems and front end user interactions that led to better team decisions.",
      "Innovated feature flag management using caching in AWS Lambdas, Redux, and remote APIs, significantly improving system stability."
    ]
  },
  {
    "jobtitle": "Software Engineer",
    "companyUrl": "https://www.workday.com",
    "company": "Workday",
    "time": "Sep 2018 - Jun 2022",
    "bullets": [
      "Led teams as a Scrum Master, contributing to the agile development of Workday's SaaS community site using Docker, PHP, and MySQL.",
      "Collaborated with product managers and UX designers to produce a modern UI/UX using React that increased revenue and engagement.",
      "Enhanced site functionality and security with new features including content audit tools, archival, and community operations.",
      "Optimized unit and integration tests and included documentation, reducing bugs and preventing product downtime at release."
    ]
  },
  {
    "jobtitle": "Software Engineer",
    "companyUrl": "https://www.tesla.com",
    "company": "Tesla (formerly SolarCity)",
    "time": "Sep 2015 - Sep 2018",
    "bullets": [
      "Refactored a solar pricing engine and brought it under a unit test harness, leading to improved reliability, scalability, and performance.",
      "Created a utility bill calculator to accurately predict customer electricity costs anywhere in the United States, boosting customer trust and minimizing legal risks.",
      "Crafted SQL queries for efficient data retrieval and object-relational mappings that optimized site load times.",
      "Diagnosed and resolved issues during live production releases that preserved thousands of dollars of revenue."
    ]
  },
  {
    "jobtitle": "Software Engineer",
    "companyUrl": "https://www.islandinsurance.com",
    "company": "Island Insurance",
    "time": "Jul 2014 - Oct 2015",
    "bullets": [
      "Developed a web portal using C# and stored procedures to retrieve customer data from over 20 insurance agencies.",
      "Programmed responsive interfaces that display data structures derived from databases, algorithms, and callbacks."
    ]
  },
  {
    "jobtitle": "Web Application Developer",
    "company": "Ideas Health",
    "time": "Sep 2014 - Jul 2014",
    "bullets": [
      "Designed the front-end of an enterprise web application using the .NET MVC framework and JavaScript.",
      "Constructed interfaces using controls such as grids, graphs, drop-downs, and calendars with agile workflow."
    ]
  },
  {
    "jobtitle": "Instructional Technician",
    "companyUrl": "https://www.livermoreschools.org/",
    "company": "Livermore School District",
    "time": "Sep 2011 - Dec 2012",
    "bullets": [
      "Established a file sharing server for students across campus, resulting in renewed enthusiasm among teachers and staff."
    ]
  },
  {
    "jobtitle": "Technical Writer",
    "company": "FileMaker",
    "time": "Jan 2010 - Jul 2010",
    "bullets": [
      "Verified and documented over 40 software errors and rewrote a popular tutorial, increasing product quality."
    ]
  },
  {
    "jobtitle": "Technical Trainer / Writer",
    "company": "Force10 Networks",
    "time": "Oct 2008 - Jun 2009",
    "bullets": [
      "Taught a rigorous networking certification course to over 20 professionals and rewrote three certification exams."
    ]
  }
]
